# groupby() function

In [2]:
import pandas as pd
df=pd.DataFrame({"name":["a","b","c","d","a","b","a","c","d","b","c","d"],
                  "S_1":[50,60,75,80,90,68,49,59,95,59,49,59],
                   "S_2":[50,60,75,80,90,68,49,59,95,59,49,59]})
df

   name  S_1  S_2
0     a   50   50
1     b   60   60
2     c   75   75
3     d   80   80
4     a   90   90
5     b   68   68
6     a   49   49
7     c   59   59
8     d   95   95
9     b   59   59
10    c   49   49
11    d   59   59

In [3]:
df_new=df.groupby("name")
df_new

In [4]:
for x,y in df_new:
    print(x)
    print(y)
    print()

a
  name  S_1  S_2
0    a   50   50
4    a   90   90
6    a   49   49

b
  name  S_1  S_2
1    b   60   60
5    b   68   68
9    b   59   59

c
   name  S_1  S_2
2     c   75   75
7     c   59   59
10    c   49   49

d
   name  S_1  S_2
3     d   80   80
8     d   95   95
11    d   59   59

# To Get the particular group data

In [6]:
df_new.get_group("a")

  name  S_1  S_2
0    a   50   50
4    a   90   90
6    a   49   49

In [7]:
df_new.min()

      S_1  S_2
name
a      49   49
b      59   59
c      49   49
d      59   59

In [8]:
df_new.max()

      S_1  S_2
name
a      90   90
b      68   68
c      75   75
d      95   95

In [9]:
df_new.mean()

            S_1        S_2
name
a     63.000000  63.000000
b     62.333333  62.333333
c     61.000000  61.000000
d     78.000000  78.000000

In [10]:
data=list(df_new)
data

[('a',
    name  S_1  S_2
  0    a   50   50
  4    a   90   90
  6    a   49   49),
 ('b',
    name  S_1  S_2
  1    b   60   60
  5    b   68   68
  9    b   59   59),
 ('c',
     name  S_1  S_2
  2     c   75   75
  7     c   59   59
  10    c   49   49),
 ('d',
     name  S_1  S_2
  3     d   80   80
  8     d   95   95
  11    d   59   59)]